In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("BBC.csv")

In [4]:
df

     ArticleId       Category
0         1018          sport
1         1319           tech
2         1138       business
3          459  entertainment
4         1020       politics
..         ...            ...
730       1923          sport
731        373           tech
732       1704       business
733        206  entertainment
734        471       politics

[735 rows x 2 columns]

In [9]:
df.head(7)

   ArticleId       Category
0       1018          sport
1       1319           tech
2       1138       business
3        459  entertainment
4       1020       politics
5         51          sport
6       2025           tech

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.tail()

     ArticleId       Category
730       1923          sport
731        373           tech
732       1704       business
733        206  entertainment
734        471       politics

In [12]:
df1= df.head()

In [13]:
df1

   ArticleId       Category
0       1018          sport
1       1319           tech
2       1138       business
3        459  entertainment
4       1020       politics

## Creating new csv file

In [14]:

df1.to_csv("testing_csv.csv")

In [15]:
pwd()

'D:\\A_Category\\iNeuron\\Basic_Python_coding'

In [16]:
import os
os.listdir()

['.ipynb_checkpoints',
 '10.Exception.ipynb',
 '10.Modules_Exception.ipynb',
 '11.Abstraction_Inheritence.ipynb',
 '2.Loops.ipynb',
 '3.String_List_Manipulation.ipynb',
 '4.List Manipulation.ipynb',
 '5.dictionary_tuple_set.ipynb',
 '6.Function_1st_class.ipynb',
 '7.Function_2nd_class.ipynb',
 '8.Logging_Debugging .ipynb',
 '9.Class_Object.ipynb',
 '9.Class_practise.ipynb',
 'BBC.csv',
 'class',
 'class2',
 'class3',
 'class3.txt',
 'file_1',
 'File_Op',
 'hw.log',
 'hw2.log',
 'logging',
 'modules_addition.py',
 'modules_test1.py',
 'Pandas.ipynb',
 'test',
 'test.txt',
 'test2.py',
 'test3',
 'test3.log',
 'test4.log',
 'testing_csv.csv',
 'Untitled.ipynb',
 '__pycache__']

In [17]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

## Seperator

In [25]:
df2 = pd.read_csv("testing_csv.csv")

In [26]:
df2

   #ArticleId#Category
0         0#1018#sport
1          1#1319#tech
2      2#1138#business
3  3#459#entertainment
4      4#1020#politics

In [27]:
df2 = pd.read_csv("testing_csv.csv", sep="#")

In [28]:
df2

   Unnamed: 0  ArticleId       Category
0           0       1018          sport
1           1       1319           tech
2           2       1138       business
3           3        459  entertainment
4           4       1020       politics

## Header = None

In [30]:
df2 = pd.read_csv("testing_csv.csv", sep="#", header=None)

In [31]:
df2

     0          1              2
0  NaN  ArticleId       Category
1  0.0       1018          sport
2  1.0       1319           tech
3  2.0       1138       business
4  3.0        459  entertainment
5  4.0       1020       politics

## Names

In [33]:
df2 = pd.read_csv("testing_csv.csv", sep="#", header=None, names = ['a', 'b', 'c'])

In [34]:
df2

     a          b              c
0  NaN  ArticleId       Category
1  0.0       1018          sport
2  1.0       1319           tech
3  2.0       1138       business
4  3.0        459  entertainment
5  4.0       1020       politics

## na _values

In [37]:
df2 = pd.read_csv("BBC.csv", na_values=['business'])

In [38]:
df2

     ArticleId       Category
0         1018          sport
1         1319           tech
2         1138            NaN
3          459  entertainment
4         1020       politics
..         ...            ...
730       1923          sport
731        373           tech
732       1704            NaN
733        206  entertainment
734        471       politics

[735 rows x 2 columns]

In [41]:
df= pd.read_csv("BBC.csv")

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df.describe()

         ArticleId
count   735.000000
mean   1099.424490
std     643.925514
min       1.000000
25%     545.500000
50%    1116.000000
75%    1657.500000
max    2225.000000

In [45]:
df.dtypes

ArticleId     int64
Category     object
dtype: object

In [46]:
df.columns

Index(['ArticleId', 'Category'], dtype='object')

In [48]:
df['Category']

0              sport
1               tech
2           business
3      entertainment
4           politics
           ...
730            sport
731             tech
732         business
733    entertainment
734         politics
Name: Category, Length: 735, dtype: object

# reading Excel

In [51]:
df2= pd.read_excel("D:\A_Category\Company_List.xlsx")

In [52]:
df2.head()

       Company  BDT/M                            Link
0       Hishab  130.0      https://hishab.co/careers/
1    CutOutWiz  165.0                             NaN
2      Softwrd   96.0  https://www.softwrd.ai/careers
3     Mayalogy   75.0                             NaN
4  Chowa Giken   70.0                             NaN

# Reading html

In [ ]:
df3 = pd.read_html(" ")